{
  "keyEvents" : [
    {
      "title" : "Remembering Red Phase",
      "description" : "Red phase is the first six weeks of freshman training as a new cadet in the Virginia Tech Corps of Cadets.  This is considered the most difficult and strict period of time, with each day regimented from start to finish.  Left turns only in the hall, walk only along the wall, greet every upperclassman by name and rank, no wearing your backpacks, no cutting across the hallway, no usage of pockets, the list goes on of intentional inconveniences.  The important lessons to be learned were the attention to detail, the ability to adhere to a strict set of rules, and the respect for those who enforce the rules. \n We were split into units called training companies, and I was a part of training company 2-1.  There were 25 buds in our training company, and we all had to hold each other accountable.  When one person messes up, everyone in the training company would face consequences.  This taught us that it isn’t always just about your own success because your team is only as strong as its’ weakest link.  Red phase taught me to focus on the success of the entire team; even if I didn’t get along with a member of the team, the mission or project at hand comes first.  This mentality applies to teams beyond a military setting because you don’t always get a team full of great people that you love but you must work with the hand you’re dealt.  Oftentimes as a freshman in the Corps, the only way to show your leadership traits was by being an active follower.  This period taught me more than any other time in my life how to lead by example; the actions you take as a follower are a large influence on the rest of the team, even if not placed into a direct leadership role.  I will always try to get an early start working on a project in a group because that motivates everyone to get going.  I also try to ask what tasks the team needs to me complete rather than doing the tasks that I want to complete."
    },
    {
      "title" : "AFSOPT INDOC",
      "description" : "Armed Forces Special Operations Preparatory Team Indoctrination… It’s tough to say all of that but even tougher to complete the three week long grueling training process required to get on the team.  I came into college wanting to fly for the Air Force, but after a year of being in AFROTC and the VTCC I realized I wanted to do something that would challenge my mind and body to the highest capacity.  This is when I switched my intended career path to becoming a Special Tactics Officer and started training to join AFSOPT.  AFSOPT is a team of likeminded individuals in the VTCC who want to commission and serve in Special Operations units for one of the branches.  Being able to complete the 3 week indoctrination process grants you access to special training tools, events, and most importantly of all, individuals also looking to push themselves to the next level.  This is, however, easier said than done.  INDOC has a similar attrition rate to that of BUD/S at about 10%. Our class started out with almost 50 people and was down to 7 by the end of the 3rd day.  If you want to be a part of the team, you better want it bad and train hard beforehand. \n When you’re bear crawling through the snow at 6 in the morning on a Friday, it really makes you question how badly you want to join the team.  When you’re running out of breath swimming 50 meters underwater on Tuesday evening instead of studying for your test the next morning, it starts to make more sense to give up on the challenge.  You can quit at any time and go back to bed, but then you’re letting yourself and the rest of your team down.  This time period really taught me the power of mental fortitude and how much even a slight bit of motivation can help in a time of need.  Whether it’s your buddy next to you carrying 60 pounds up a hill or the programmer next to you struggling to solve a bug for a week straight, you have the capability, and responsibility, to be a source of motivation for them.  As a leader, I take it upon myself to help others realize their true potential.  I’m a firm believer that every single person is so much more capable than they realize; the number one thing holding you back is simply the limitation you put on yourself."
    },
    {
      "title" : "Sophomore Cadet NCO",
      "description" : "The transition from freshman cadet from a sophomore cadet in the Virginia Tech Corps of cadets is a huge step in terms of freedom and responsibility.  As a junior in the Corps, I was responsible for training the sophomore cadets and giving them their freedoms incrementally as they learn how to be upperclassmen.  This included lessons on proper interactions with the freshmen, assigning weekly tasks and curfew assignment according to their performance as a sophomore class.  In order to get the sophomores to know each other and the rest of the cadets in our company, they were to write journals interviewing each member of the company.  Upon the completion of this task, the sophomore classes’ weekend curfew would be lifted.  Taking on this role taught me a big lesson on having to make the right decision and stick to my word rather than making the popular decision. \n It was 5 weeks into school and almost everyone had completed their journals in full.  I wanted more than anything else to just let everyone stay out that weekend, but sometimes you must make the hard decisions as a leader.  There were still two people letting the rest of the team down, and I had to make everyone stay in for another weekend.  This was the first time I had to make a truly unpopular decision as a leader, and while it didn’t feel great at the time I knew that I had made the right decision.  The other sophomores held the other two accountable and made sure they finished it over the weekend, and everyone got their curfew lifted the next weekend.  This scenario will guide my decision-making skills in leadership for years to come because part of being a good leader is ensuring your people are accountable and face the consequences of their actions."
    }
  ]
}
